# SQL

* https://github.com/PyMySQL/PyMySQL

In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

## Pymysql connect

* The first way we can connect via Python with MySQL is to use pymysql.connect. 

* We have to use our host, password, and the database we are using (db). Here we are connected to the **animals_db** database.

* Don't worry about the code too much. It takes a string, splits it by semicolons (;), and send each command to MySQL using the cursor.execute command.

* If there's an error it prints the error.

In [2]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='kcmo1728',
                             db='animals_db',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [14]:
sql_command = """
drop table if exists people;
create table people (
  name varchar(30) not null,
  has_pet boolean not null,
  pet_name varchar(30),
  pet_age integer(10)
);
"""

In [17]:
RunSQL(sql_command)

## SQLAlchemy create_engine

* This is a different library. 

* It allows us to import our query into pandas automatically. 

* Super powerful library. We will see more that it can do next week.

* The connection string is composed of five distinct parts and can be constructed by following the following syntax:
  
    `<Dialect>://<Username>:<Password>@<Host Address>:<Port>/<Database>`

In [18]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/animals_db')
data = pd.read_sql_query('select * from people', engine)
data

Empty DataFrame
Columns: [name, has_pet, pet_name, pet_age]
Index: []

In [19]:
sql_command = """
INSERT INTO people (name, has_pet, pet_name, pet_age)
VALUES ("Jacob", true, "Misty", 10);

INSERT INTO people (name, has_pet, pet_name, pet_age)
VALUES ("Ahmed", true, "Rockington", 100);

INSERT INTO people (name, has_pet, pet_name, pet_age)
VALUES ("Ahmed", true, "Rockington", 100);


INSERT INTO people (name, has_pet)
VALUES ("Peter", false);
"""
RunSQL(sql_command)

In [20]:
data = pd.read_sql_query('select * from people', engine)
data

    name  has_pet    pet_name  pet_age
0  Jacob        1       Misty     10.0
1  Ahmed        1  Rockington    100.0
2  Ahmed        1  Rockington    100.0
3  Peter        0        None      NaN

* We can also use **engine.execute** to pass in a query string. It won't end up in Pandas this way, but can still be useful.

In [21]:
data = engine.execute("select * from people;")
for record in data:
    print(record)

('Jacob', 1, 'Misty', 10)
('Ahmed', 1, 'Rockington', 100)
('Ahmed', 1, 'Rockington', 100)
('Peter', 0, None, None)

* And don't forget. If things get messy, just drop back into MySQLWorkbench.

In [10]:
sql_command = """
delete from people 
where name = "Ahmed";
"""
RunSQL(sql_command)
data = pd.read_sql_query('select * from people', engine)
data

    name  has_pet pet_name  pet_age
0  Jacob        1    Misty     10.0
1  Peter        0     None      NaN

Oops! There all gone! To prevent this kind of thing from occurring, programmers will often times want to create a column that automatically populates each new row with unique data. This allows them to select and affect that row more easily.

In [11]:
sql_command = """
drop table people;
create table people (
  -- Creates a numeric column called "id" which will automatically increment its default value as we create new rows --
  id integer(11) auto_increment not null,
  name varchar(30) not null,
  has_pet boolean not null,
  pet_name varchar(30),
  pet_age integer(10),
  -- Sets id as this table's primary key which means all data contained within it will be unique --
  primary key(id)
);
-- Creates new rows containing data in all named columns --
INSERT INTO people (name, has_pet, pet_name, pet_age)
VALUES ("Ahmed", true, "Rockington", 100);

INSERT INTO people (name, has_pet, pet_name, pet_age)
VALUES ("Ahmed", true, "Rockington", 100);

INSERT INTO people (name, has_pet, pet_name, pet_age)
VALUES ("Jacob",true,"Misty",10);

INSERT INTO people (name, has_pet)
VALUES ("Peter", false);
"""
RunSQL(sql_command)
data = pd.read_sql_query('select * from people', engine)
data

   id   name  has_pet    pet_name  pet_age
0   1  Ahmed        1  Rockington    100.0
1   2  Ahmed        1  Rockington    100.0
2   3  Jacob        1       Misty     10.0
3   4  Peter        0        None      NaN

In [12]:
sql_command = """
delete from people 
where id = 2;
"""
RunSQL(sql_command)
data = pd.read_sql_query('select * from people', engine)
data

   id   name  has_pet    pet_name  pet_age
0   1  Ahmed        1  Rockington    100.0
1   3  Jacob        1       Misty     10.0
2   4  Peter        0        None      NaN